package by.corp.LDA.homeworkTask2;
/*Создать класс: Товар, Цветок, Аксесуар.
        Букет (товар): состоит из аксесуаров и и цветов. Количество одинаковых цветов и аксессуаров в букете не должно превышать
        трех. Выбрасывать исключение, если такая ситуация получается.
        Определить для всех классов методы: equals, hashcode, toString.
        Поля для товара: наименование, стоимость.
        Поля для цветка: наименование, длина стебля, количество бутонов, цвет бутонов. Поля для класса аксессуар: материал (к
        примеру дерево), тип (игрушка, опора)
        Добавить метод по сборке цветов
        Получить центу собранного букета
        Вывести информацию в консоль*/
public class Product {
    public static void main(String[] args) {

    }
}
